Revit 2024 API
BuiltInFailures.CreationFailures.CannotDrawSingularSlantedWall Property
 Cannot create wall - it would intersect itself. Reduce the wall's height or slant.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDrawSingularSlantedWall { get; }
Visual Basic
Public Shared ReadOnly Property CannotDrawSingularSlantedWall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDrawSingularSlantedWall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace